In [44]:
import pandas as pd

In [45]:
name=['Anirudh','Dhoni','Kawasaki','Prabhas','Rajini']
age=[33,42,40,44,73]
name,age

(['Anirudh', 'Dhoni', 'Kawasaki', 'Prabhas', 'Rajini'], [33, 42, 40, 44, 73])

$Step-1$

$CreateDataFrame$

In [46]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

$Step-2$

$Provide Data$

In [47]:
pd.DataFrame(zip(name,age))

          0   1
0   Anirudh  33
1     Dhoni  42
2  Kawasaki  40
3   Prabhas  44
4    Rajini  73

$Step-3$

$Provide Columns$

In [49]:
data=zip(name,age)
cols=['Name','Age']
pd.DataFrame(data,columns=cols)

       Name  Age
0   Anirudh   33
1     Dhoni   42
2  Kawasaki   40
3   Prabhas   44
4    Rajini   73

$Step-4$

$Provide Index$

In [50]:
data=zip(name,age)
cols=['Names','Age']
ind=[1,2,3,4,5]
pd.DataFrame(data,columns=cols,index=ind)

      Names  Age
1   Anirudh   33
2     Dhoni   42
3  Kawasaki   40
4   Prabhas   44
5    Rajini   73

$Step-5$

$Add New Index$

In [51]:
data=zip(name,age)
cols=['Name','Age']
ind=[1,2,3,4,5]
df=pd.DataFrame(data,columns=cols,index=ind)

In [52]:
city_name=['Chennai','Ranchi','Tokyo','Chennai','Bengaluru']
df['City']=city_name
df

       Name  Age       City
1   Anirudh   33    Chennai
2     Dhoni   42     Ranchi
3  Kawasaki   40      Tokyo
4   Prabhas   44    Chennai
5    Rajini   73  Bengaluru

$Step-6$

$Update The Existing Column$

In [53]:
df['Name']=['Anirudh Ravichander','Mahendra Singh Dhoni','Kawasaki Ninja','Prabhas Raju','Rajinikanth']
df

                   Name  Age       City
1   Anirudh Ravichander   33    Chennai
2  Mahendra Singh Dhoni   42     Ranchi
3        Kawasaki Ninja   40      Tokyo
4          Prabhas Raju   44    Chennai
5           Rajinikanth   73  Bengaluru

$Step-7$

$Drop Colunm$

In [54]:
df.drop('Age',axis=1,inplace=True)
df

                   Name       City
1   Anirudh Ravichander    Chennai
2  Mahendra Singh Dhoni     Ranchi
3        Kawasaki Ninja      Tokyo
4          Prabhas Raju    Chennai
5           Rajinikanth  Bengaluru

$Step-8$

$Drop Rows$

In [55]:
df.drop(3,axis=0,inplace=True)
df

                   Name       City
1   Anirudh Ravichander    Chennai
2  Mahendra Singh Dhoni     Ranchi
4          Prabhas Raju    Chennai
5           Rajinikanth  Bengaluru

$Step-9$

$Save data frame$

In [56]:
df.to_csv("TUT.csv")
df.to_excel("TUT.xlsx")

In [57]:
pd.read_csv("TUT.csv")

   Unnamed: 0                  Name       City
0           1   Anirudh Ravichander    Chennai
1           2  Mahendra Singh Dhoni     Ranchi
2           4          Prabhas Raju    Chennai
3           5           Rajinikanth  Bengaluru

$Step-10$

$Remove the index$

In [58]:
df.to_csv("TUT.csv",index=False)

In [59]:
pd.read_csv("TUT.csv")

                   Name       City
0   Anirudh Ravichander    Chennai
1  Mahendra Singh Dhoni     Ranchi
2          Prabhas Raju    Chennai
3           Rajinikanth  Bengaluru

**Create Dataframes Using Dictinonary**

In [63]:
d1={"Names":["Prabhas","Dhoni","Anirudh"],
   "Age":[44,42,33]}
pd.DataFrame(d1)

     Names  Age
0  Prabhas   44
1    Dhoni   42
2  Anirudh   33